InformationRegisters/Renault_ПользователиИШаблоныПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПользователиИШаблоныПравИНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваИНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПраваИНастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ТарифНаКомплектацииАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТарифНаКомплектацииАвтомобилей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаКлиентская</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаДилерская</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДоступноКЗаказуВПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенКорпКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТарифыНаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГодПТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрав</Name>
					<Comment>Права берутся от другого пользователя, указанного в этом реквизите</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИспользованияОборудования</Name>
					<Comment>0 - обычный режим, 1 - локальное оборудование недоступно для других, 2 - запрещено любое использование оборудования</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяШаблоном</Name>
					<Comment>Является шаблоном</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольККМ</Name>
					<Comment>пароль-идентификатор кассира при работе с КММ(ФР)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФункциональнойПанели</Name>
					<Comment>Настройка функциональной панели</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиФункциональнойПанели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпТекущийВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинСмит</Name>
					<Comment>Только Ниссан</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольСмит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интерфейс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UsGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоменнаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольДоменнойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиАРМОтчеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиАРМОтчеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_ТарифыНаАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ТарифыНаАвтомобили</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенКорпКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Renault_ОбщиеФункции/Ext/Module.bsl
//+ СКД
&НаСервере
//Для источника данных на основе основной таблицы
Функция ИсточникДанныхФормы(Форма,ИмяСписка) Экспорт 
	ТекстЗапроса=?(Форма[ИмяСписка].ОсновнаяТаблица<>"","Выбрать * Из "+Форма[ИмяСписка].ОсновнаяТаблица,"");
	Схема=СхемаПоЗапросу(ТекстЗапроса);
	URLСхемы=ПоместитьВоВременноеХранилище(Схема,Форма.УникальныйИдентификатор);
	Возврат Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
КонецФункции

&НаСервере
//Для источника данных "произвольный запрос", запрос можно получить из формы (толстый клиент) ЭтаФорма[ИмяДинамическогоСписка].ТекстЗапроса
Функция ПроизвольныйИсточникДанных(ТекстЗапроса) Экспорт 
	Схема=СхемаПоЗапросу(ТекстЗапроса);
	URLСхемы=ПоместитьВоВременноеХранилище(Схема,Новый УникальныйИдентификатор);
	Возврат Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
КонецФункции

&НаСервере
Функция СхемаПоЗапросу(ТекстЗапроса) Экспорт
	Схема=Новый СхемаКомпоновкиДанных;
	ИсточникДанных=Схема.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя="Источник";
	ИсточникДанных.ТипИсточникаДанных="Local";
	НаборДанных=Схема.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя="НаборДанных";
	НаборДанных.ИсточникДанных="Источник";
	НаборДанных.Запрос=ТекстЗапроса;
	Возврат Схема
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуОтбора(Форма, ИсточникДоступныхНастроек, КомпоновщикНастроек, ФункцияОповещения, ПараметрФункцииОповещения,Настройки=Ложь,ФиксированныеНастройки=Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Настройка отбора");
	ПараметрыФормы.Вставить("ИсточникДоступныхНастроек", ИсточникДоступныхНастроек);
	
	//ПараметрыФормы.Вставить("ПользовательскиеНастройки", ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ПользовательскиеНастройки);
	Если ФиксированныеНастройки Тогда
		ПараметрыФормы.Вставить("ФиксированныеНастройкиОтбор", Истина);
		ПараметрыФормы.Вставить("ФиксированныеНастройки", КомпоновщикНастроек.ФиксированныеНастройки);
	КонецЕсли;
	Если Настройки Тогда
		ПараметрыФормы.Вставить("НастройкиОтбор", Истина);
		ПараметрыФормы.Вставить("Настройки", КомпоновщикНастроек.Настройки);
	КонецЕсли;
	
	Если СтараяПлатформа() Тогда
		Сообщить("Функционал не доступен", СтатусСообщения.Информация);
	Иначе
		Выполнить("ОткрытьФорму(""ОбщаяФорма.Renault_ОтборСписка"",ПараметрыФормы,Форма,Форма.УникальныйИдентификатор,,,Новый ОписаниеОповещения(ФункцияОповещения,Форма,ПараметрФункцииОповещения),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)")
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКомпоновщикНастроек(Форма,КомпоновщикНастроек,ФункцияОповещения,ПараметрФункцииОповещения=Неопределено,Настройки=Истина,ФиксированныеНастройки=Ложь) Экспорт
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Настройка отбора");
	ПараметрыФормы.Вставить("КомпоновщикНастроек", КомпоновщикНастроек);
	
	Если ФиксированныеНастройки Тогда
		ПараметрыФормы.Вставить("ФиксированныеНастройкиОтбор", Истина);
		ПараметрыФормы.Вставить("ФиксированныеНастройки", КомпоновщикНастроек.ФиксированныеНастройки);
	КонецЕсли;
	Если Настройки Тогда
		ПараметрыФормы.Вставить("НастройкиОтбор", Истина);
		ПараметрыФормы.Вставить("Настройки", КомпоновщикНастроек.Настройки);
	КонецЕсли;
	
	Если СтараяПлатформа() Тогда
		Сообщить("Функционал не доступен",СтатусСообщения.Информация);
	Иначе
		Выполнить("ОткрытьФорму(""ОбщаяФорма.Renault_ОтборСписка"",ПараметрыФормы,Форма,Форма.УникальныйИдентификатор,,,Новый ОписаниеОповещения(ФункцияОповещения,Форма,ПараметрФункцииОповещения),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)")
	КонецЕсли;
	
КонецПроцедуры
//- СКД
&НаСервере
Функция СотрудникПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос("Выбрать Первые 1 Сотрудник Из Справочник.Пользователи ГДЕ Ссылка=&Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Сотрудник;
	
КонецФункции

&НаСервере
Функция ПраваПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос("Выбрать ПраваИНастройки Из РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек ГДЕ Пользователь=&Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ПраваИНастройки;
	
КонецФункции

&НаСервере
//версии моделей автомобилей
Функция ВариантыКомплектаций(Модель, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, ТекущаяДата(), Дата));
	Запрос.Текст = "
	|Выбрать ВариантКомплектации
	|ИЗ РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(,
	|	Тариф В(
	|		Выбрать Первые 1 Ссылка Из Справочник.Renault_ТарифыНаАвтомобили
	|		ГДЕ Активен И НачалоДействия<=&Дата И (ОкончаниеДействия>=&Дата ИЛИ ОкончаниеДействия=ДатаВремя(1,1,1))
	|		Упорядочить По НачалоДействия УБЫВ
	|	) И Модель=&Модель
	|)
	|ГДЕ ДоступноКЗаказуВПроизводство
	|Упорядочить По ВариантКомплектации.Наименование
	|";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВариантКомплектации")
	
КонецФункции

&НаСервере
//по умолчанию фреймворк IE11+, но в настройках шаблона можно задать IE8
Функция ПолучитьИмяФреймворкаОтчетов() Экспорт
	Возврат ?(Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ФреймворкОтчетов = "", "Renault_Highcharts", Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ФреймворкОтчетов);
КонецФункции

//ОФУ
&НаКлиенте
Функция ПолучитьОтделОФУ(ЭтаФорма,Отдел="") Экспорт //определяем отдел КСО по КлассификацияRenault=КСО
		
	спОтделы = Renault_ОбщиеФункцииСервер.ПолучитьОтделОФУнаСервере(); 
	
	Если спОтделы.Количество() = 1 Тогда Возврат спОтделы[0] КонецЕсли;
	
	Сп = Новый СписокЗначений;
	Сп.ЗагрузитьЗначения(спОтделы);
	Если Отдел <> "" И Сп.НайтиПоЗначению(Отдел)<>Неопределено Тогда
		Сп.НайтиПоЗначению(Отдел).Пометка = Истина;
	КонецЕсли;
	
	Парам = Новый Структура;
	Парам.Вставить("Список", Сп);
	Парам.Вставить("Заголовок", "Отдел консультации (ОФУ)");
	Парам.Вставить("МножественныйВыбор", Ложь);
	Парам.Вставить("КоличествоЭлементовВСтроке", 4);
	Парам.Вставить("ШиринаЭлемента", 12);
	Парам.Вставить("ВысотаЭлемента", 2);
	Возврат ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам, ЭтаФорма);
	
КонецФункции

&НаКлиенте
Функция ПолучитьМенеджераОФУ(ЭтаФорма, ТекМенеджер = "") Экспорт
	
	спМенеджеры= Renault_ОбщиеФункцииСервер.ПолучитьМенеджераОФУнаСервере();

	Если спМенеджеры.Количество()=1 Тогда Возврат спМенеджеры[0] КонецЕсли;
	
	Сп=Новый СписокЗначений; Сп.ЗагрузитьЗначения(спМенеджеры);
	Если ТекМенеджер<>"" Тогда
		Для Каждого Эл Из Сп Цикл Если Эл.Значение=ТекМенеджер Тогда Эл.Пометка=Истина КонецЕсли КонецЦикла;	
	КонецЕсли;
	
	Парам=Новый Структура;
	Парам.Вставить("Список",Сп);
	Парам.Вставить("Заголовок","Сотрудник отдела (ОФУ)");
	Парам.Вставить("МножественныйВыбор",Ложь);
	Парам.Вставить("КоличествоЭлементовВСтроке",4);
	Парам.Вставить("ШиринаЭлемента",17);
	Парам.Вставить("ВысотаЭлемента",2);
	Возврат ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений",Парам,ЭтаФорма);
КонецФункции	

Функция СтараяПлатформа(СравнитьСВерсией = 2) Экспорт
	
	Перем Старая;
	СисИнфо = Новый СистемнаяИнформация;
	Попытка
		Старая = (Число(Сред(СисИнфо.ВерсияПриложения,3,1)) <= СравнитьСВерсией);
	Исключение
		Старая=Ложь;
	КонецПопытки;
	
	Если Старая Тогда
		Сообщить("Ваша платформа устарела." + Символы.ПС + Символы.Таб + "Корректная работа приложения не гарантируется", СтатусСообщения.ОченьВажное);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция УбратьИзНомераТелефонаВсеБуквы(НомерТелефона) Экспорт
	
	ТолькоЦифрыНомера = "";
	Для а = 1 По СтрДлина(НомерТелефона) Цикл
		Если СтрЧислоВхождений("1234567890", Сред(НомерТелефона,а,1)) > 0 Тогда
			ТолькоЦифрыНомера = ТолькоЦифрыНомера + Сред(НомерТелефона,а,1);
		КонецЕсли;
	КонецЦикла;
	Возврат ТолькоЦифрыНомера;
	
КонецФункции

&НаКлиенте
Функция ПреобразоватьНомерДляСохранения(Знач НомерТелефона, ЧислоСимволов) Экспорт
	
	Префикс = "1";
	НомерТелефона = УбратьИзНомераТелефонаВсеБуквы(НомерТелефона);
	Возврат ?(НЕ ЗначениеЗаполнено(НомерТелефона), 0, Число(Префикс + Прав(СокрЛП(НомерТелефона), ЧислоСимволов)));
	
КонецФункции

//#Область мультибрендовость
&НаКлиенте
//Логотип,ОсновнойЦвет,ДопЦвет1,ДопЦвет2,ЦветФона,ЦветТекста 
Функция МультибрендПараметрыОформления() Экспорт Возврат Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления() КонецФункции 

&НаКлиенте
//где МассивЭлементовАкт - массив элементов формы, логитип и сама форма
// МассивЭлементовПас - не активные элементы кнопки и пр..
Процедура МультибрендОсновноеОформление(МассивЭлементовАкт,МассивЭлементовПас="") Экспорт 
	Парам=МультибрендПараметрыОформления();
	ОсновнойЦвет=Вычислить(Парам.ОсновнойЦвет);
	ДопЦвет1=Вычислить(Парам.ДопЦвет1);
	
	Попытка
		ТипКн = Тип("Кнопка");
		ОбычноеПриложение = Истина;
	Исключение
		ОбычноеПриложение = Ложь;
	КонецПопытки;
	
	ТипКнопка = ?(ОбычноеПриложение,Тип("Кнопка"),Неопределено);	
	ТипПолеКартинки = ?(ОбычноеПриложение,Тип("ПолеКартинки"),Неопределено);	
	ТипПолеВвода = ?(ОбычноеПриложение,Тип("ПолеВвода"),Неопределено);
	ТипДекорацияФормы = ?(ОбычноеПриложение,Тип("ДекорацияФормы"),Неопределено);
	ТипФорма = ?(ОбычноеПриложение,Тип("Форма"),Неопределено);
	
	Для Каждого Эл Из МассивЭлементовАкт Цикл
		
		Если ТипЗнч(Эл)=ТипКнопка Тогда
			Эл[?(ОбычноеПриложение,"ЦветФонаКнопки","ЦветФона")]=ОсновнойЦвет;
			Эл.ЦветРамки=ОсновнойЦвет;
			Эл.ЦветТекста=ОсновнойЦвет;
		ИначеЕсли ТипЗнч(Эл)=ТипПолеКартинки Тогда
			Эл.Картинка=Вычислить(Парам.Логотип);
		ИначеЕсли ТипЗнч(Эл)=ТипФорма Тогда
			Эл.Панель.ЦветФона=Вычислить(Парам.ЦветФона);
		ИначеЕсли ТипЗнч(Эл) = ТипПолеВвода Тогда
			Эл.ЦветФона=ОсновнойЦвет;
			Эл.ЦветФонаКнопки=ОсновнойЦвет;
		ИначеЕсли ТипЗнч(Эл) = ТипДекорацияФормы Тогда
			Эл.Картинка = Вычислить(Парам.Логотип);
		Иначе
			Эл.ЦветФона=ОсновнойЦвет;
		КонецЕсли;	
	КонецЦикла;
	
	Если МассивЭлементовПас="" Тогда Возврат КонецЕсли;
	Для Каждого Эл Из МассивЭлементовПас Цикл
		Если ТипЗнч(Эл)=ТипКнопка Тогда
			Эл[?(ОбычноеПриложение,"ЦветФонаКнопки","ЦветФона")]=ДопЦвет1;
			Эл.ЦветРамки=ДопЦвет1;
			Эл.ЦветТекста=ДопЦвет1;
		Иначе
			Эл.ЦветФона=ДопЦвет1;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
//СвойствоЭлемента - типа ЦветФона, ЦветТекста ...
//Параметр - имя параметра из МультибрендПараметрыОформления()
Процедура МультибрендЗадатьОформление(МассивЭлементов,СвойствоЭлемента,Параметр) Экспорт 
	ЗначениеПараметра=Вычислить(МультибрендПараметрыОформления()[Параметр]);
	Для Каждого Эл Из МассивЭлементов Цикл Выполнить("Эл."+СвойствоЭлемента+"=ЗначениеПараметра") КонецЦикла
КонецПроцедуры	
//#КонецОбласти
